[
    {
      "id": "0001",
      "pic": "https://storage.googleapis.com/hatchways-app.appspot.com/assessments/data/frontend/images/voluptasdictablanditiis.jpg",
      "sub": "JBC Seeds",
      "user": "JBCSeeds",
      "date": "Feb 8, 2019",
      "content": "Due to numerous requests, we've decided to make a thread here on Roll It Up. Before we get started, we'd like to thank our current customers for your business and invite everyone else to make the JBC family a part of your own.",
      "replies": 2,
      "repliesdetail":[{
          "rid": "0001-0001",
          "ruser":"Useful Seeds",
          "rpic": "https://storage.googleapis.com/hatchways-app.appspot.com/assessments/data/frontend/images/aspernaturnonsapiente.jpg",
          "rcontent": "RIU, what's happenin'... Due to numerous requests, we've decided to make a thread here on Roll It Up. Before we get started, we'd like to thank our current customers for your business and invite everyone else to make the JBC family a part of your own.",
          "rdate": "Feb 9, 2019"
        },
        {
          "rid": "0001-0002",
          "ruser":"JBC Seeds",
          "rpic": "https://storage.googleapis.com/hatchways-app.appspot.com/assessments/data/frontend/images/voluptasdictablanditiis.jpg",
          "rcontent": "will do. Thanks!",
          "rdate": "Feb 9, 2019"
        }
      ]
    },
    {
      "id": "0002",
      "pic": "https://storage.googleapis.com/hatchways-app.appspot.com/assessments/data/frontend/images/voluptasautreprehenderit.jpg",
      "sub": "Water: The Most Essential Compound",
      "user": "doc111",
      "date": "Jan 8, 2010",
      "content": "Water is water right? Wrong. I see a lot of growers that have all this knowledge about nutrients and photoperiods but know very little about the water they use and that not all water is created equal and some water isn't very well suited for growing at all. I decided to do this thread to help educate growers about the water they use and why it's important to understand",
      "replies": 2,
      "repliesdetail":[{
          "rid": "0002-0001",
          "ruser":"Useful Seeds",
          "rpic": "https://storage.googleapis.com/hatchways-app.appspot.com/assessments/data/frontend/images/aspernaturnonsapiente.jpg",
          "rcontent": "I'm going to check this out.  Also I always thought it would be nice to know how many hours are on a bulb since it was replaced. I write down on my bulb box's the amount of hours on them when I switch so I don't lose track on when I should switch. I don't know if anyone else could see this as helpful but it's a thought.",
          "rdate": "Jan 9, 2019"
        },
        {
          "rid": "0002-0002",
          "ruser":"JBC Seeds",
          "rpic": "https://storage.googleapis.com/hatchways-app.appspot.com/assessments/data/frontend/images/consequaturdelectusquis.jpg",
          "rcontent": "Woo! We're live! Lx - just run a VirtualOS app. I considered a phone version of the app... simply interface with the instance on the desktop. Authenticated, using the API we've discussed. Could take pictures/video direct on your phone and it is transferred to your desktop automagically. I think Apple and Google would approve it. No idea about Microsoft.",
          "rdate": "Jan 9, 2019"
        }
      ]
    }
  ]
  
